diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресВХ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ПревышениеОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ПлановыеОтпуска/ВКМ_ПлановыеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПлановыеОтпуска</name>
  <resources>
    <name>ВКМ_ДатаНачало</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ОтпускПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
//Начало доработки Барышникова Ю.А 12.11.2024


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим) 
	
 
	// регистр ВКМ_ПлановыеОтпуска
	
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	
	Для Каждого ТекСтрокаВКМ_ОтпускаСотрудников Из ВКМ_ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник;
		Движение.ВКМ_ДатаНачало = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачало;
		Движение.ВКМ_ОтпускПлан = (ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания-ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачало+86400)/86400;
	КонецЦикла;

КонецПроцедуры  

#КонецОбласти

#КонецЕсли

//конец дорабтки
